# Interop Class

## Overview
Provides interoperability utilities for AutoCAD .NET API.

## Namespace
`Autodesk.AutoCAD.Runtime`

## Key Methods
- Various interop conversion methods

## Code Example
```csharp
using Autodesk.AutoCAD.Runtime;

// Interop utilities for managed/unmanaged code interaction
```

## Related Classes
- DisposableWrapper

## References
- Autodesk Official Documentation