# CommandClass Class

## Vue d'Ensemble
La classe `CommandClass` représente une classe de commande enregistrée dans AutoCAD.

## Namespace
`Autodesk.AutoCAD.Runtime`

## Propriétés

| Propriété | Description |
|-----------|-------------|
| `Name` | Nom de la classe de commande |
| `Commands` | Collection de commandes |

## Références
- Documentation Officielle Autodesk