# DisposableWrapper Class

## Vue d'Ensemble
La classe `DisposableWrapper` est une classe de base pour les objets qui implémentent IDisposable.

## Namespace
`Autodesk.AutoCAD.Runtime`

## Méthodes

| Méthode | Description |
|---------|-------------|
| `Dispose()` | Libère les ressources |
| `Dispose(bool)` | Libère les ressources managées et non managées |

## Références
- Documentation Officielle Autodesk