# Interop Class

## Vue d'Ensemble
La classe `Interop` fournit des méthodes pour l'interopérabilité entre .NET et COM.

## Namespace
`Autodesk.AutoCAD.Runtime`

## Méthodes Statiques

| Méthode | Description |
|---------|-------------|
| `GetIUnknownForObject(object)` | Obtient le pointeur IUnknown pour un objet |

## Références
- Documentation Officielle Autodesk