# Publisher Class

## Overview
The `Publisher` class handles batch plotting and publishing operations in AutoCAD, allowing you to publish multiple sheets to DWF, PDF, or plotter.

## Namespace
`Autodesk.AutoCAD.ApplicationServices`

## Code Examples

### Example 1: Accessing Publisher
```csharp
using Autodesk.AutoCAD.ApplicationServices;

dynamic publisher = Application.Publisher;

// Publisher is available for batch plotting operations
ed.WriteMessage("\nPublisher object accessed");
```

### Example 2: Publishing to PDF (Conceptual)
```csharp
using Autodesk.AutoCAD.ApplicationServices;
using Autodesk.AutoCAD.PlottingServices;

// Note: Publishing typically requires PlotEngine and DSD file setup
// This is a simplified conceptual example

dynamic publisher = Application.Publisher;

// Create DSD (Drawing Set Descriptions) file
// Configure sheets to publish
// Execute publish operation

ed.WriteMessage("\nPublish operation initiated");
```

## Related Objects
- Application - Provides access to Publisher
- PlotEngine - Plotting engine
- DsdData - Drawing set description data

## References
- Autodesk Official Documentation